docs/leets/0039-Combination-Sum.org
#+TITLE: Combination Sum Problem Overview and Solution Plan
  :PROPERTIES:
  :Created: 2024-05-13
  :END:

* Link
[[https://leetcode.com/problems/combination-sum/description/][2024-05-13 Combination Sum - LeetCode]]

* Problem Overview:
  The "Combination Sum" problem asks us to find all unique combinations in a given set of candidate numbers that sum up to a target number. The numbers in the candidates set can be used multiple times in the combination, and the solution set must not contain duplicate combinations.

* Solution Outline:
** Preferred Structure:
   Utilizing recursion for backtracking is highly effective here since we need to explore all possible combinations that sum up to the target. An array or list can be used to store the current combination of numbers being considered.

** Brute Force vs Optimal Solution:
   - *Brute Force:* Try all possible combinations of numbers to see which ones meet the target sum. This would involve recursion or iteration over each number and is not efficient.
   - *Optimal Solution:* Use backtracking to build combinations efficiently. Only continue adding to the current combination if the sum has not exceeded the target.
   - *Spoilers:* The use of backtracking helps in pruning unnecessary computations, making the solution much more efficient than the brute force approach.

** Algorithm Choice:
   - The backtracking algorithm is ideal here due to its ability to eliminate many non-viable combinations early, especially when the current sum exceeds the target. This approach significantly reduces the number of combinations to check.

#+begin_src js
// Function to find all combinations that sum up to a given target
function combinationSum(candidates, target) {
    // Initial call to the recursive function with empty combination
    const results = [];
    findCombinations(candidates, target, [], results, 0);
    return results;
}

// Recursive function to find combinations
function findCombinations(candidates, target, current, results, index) {
    // Base case: if target is zero, a valid combination is found
    if (target === 0) {
        results.push([...current]);
        return;
    }

    // Explore further only if the remaining target is positive
    if (target > 0) {
        for (let i = index; i < candidates.length; i++) {
            current.push(candidates[i]);
            // Recursively call to build the rest of the combination
            findCombinations(candidates, target - candidates[i], current, results, i);
            current.pop(); // Backtrack
        }
    }
}

// Test cases
const testCases = [
    { candidates: [2,3,6,7], target: 7, expected: [[2,2,3], [7]] },
    { candidates: [2,3,5], target: 8, expected: [[2,2,2,2], [2,3,3], [3,5]] },
    // Include more test cases and edge cases
];

testCases.forEach((test, index) => {
    const result = combinationSum(test.candidates, test.target);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
#+end_src
